Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/health/health_services_for_people_with_disabilities/intellectual_disability_database.html.txt.tmx
Source language: en
Languages: ga

source: National Intellectual Disability Database
ga: An Bunachar Sonraí Náisiúnta um Míchumas Intleachta

source: The National Intellectual Disability Database is a database of information about people who are receiving intellectual disability services in Ireland or who are in need of these services
ga: Bunachar sonraí faisnéise faoi dhaoine a bhfuil seirbhísí um míchumas intleachta á bhfáil acu in Éirinn nó a dteastaíonn na seirbhísí seo uathu, atá sa Bhunachar Náisiúnta um Míchumas Intleachta

source: The objective of the database is to ensure that accurate information is available about the needs of people with intellectual disabilities
ga: Is é cuspóir an bhunachair seo a chinntiú go bhfuil faisnéis chruinn ar fáil faoi riachtanais daoine atá faoi mhíchumas intleachta

source: Services are planned and co-ordinated on the basis of the information contained in the database
ga: Déantar seirbhísí a phleanáil agus a chomhordú ar bhonn na faisnéise a chuimsítear sa bhunachar sonraí seo

source: There is also a National Physical and Sensory Disability Database
ga: Anuas air sin, tá Bunachar Sonraí Náisiúnta um Míchumas Fisiciúil agus Céadfach ann chomh maith

source: The information on the database is gathered by service providers who are in contact with people with intellectual disabilities
ga: Bailíonn soláthraithe seirbhíse an fhaisnéis ar an mbunachar sonraí a dhéanann teagmháil le daoine atá faoi mhíchumas intleachta

source: For example, Local Health Offices, voluntary bodies, and school principals
ga: Mar shampla, Oifigí Sláinte Áitiúla, comhlachtaí deonacha, agus príomhoidí scoile

source: The information is given to Health Service Executive Local Health Offices
ga: Tugtar an fhaisnéis d’Oifigí Sláinte Áitiúla Fheidhmeannacht na Seirbhíse Sláinte

source: The information is collected at national level, without any personal details such as name or address, and it is analysed by the Health Research Board
ga: Bailítear an fhaisnéis ar leibhéal náisiúnta, gan aon sonraí pearsanta a bhailiú, ar nós ainm nó seolta, agus déanann an Bord Taighde Sláinte anailís uirthi

source: The statistical information is used to monitor current service provision and to predict future service requirements
ga: Úsáidtear an fhaisnéis staitistiúil chun monatóireacht a dhéanamh ar sholáthar reatha seirbhíse agus chun riachtanais seirbhíse amach anseo a thuar

source: Access to the database
ga: Rochtain ar an mbunachar sonraí

source: If there are details about you on the database, these details may be accessed by:
ga: Má tá sonraí ann fút ar an mbunachar sonraí, féadfaidh na daoine a leanas na sonraí a rochtain:

source: • You (or, for a child, by the parents or guardians)
ga: • Tú féin (nó, i gcás linbh, na tuismitheoirí nó na caomhnóirí)

source: • By a small number of people working for your service provider and/or your Local Health Office
ga: • Líon beag daoine a oibríonn le do sholáthraí seirbhíse agus/nó d’Oifig Sláinte Áitiúil

source: The statistical information from the database, that is, information that does not identify any individual person is available to:
ga: Tá an fhaisnéis staitistiúil ón mbunachar sonraí, is é sin, an fhaisnéis nach ndéanann aon duine aonair a shainaithint, ar fáil ag:

source: • The Health Research Board
ga: • An Bord Taighde Sláinte

source: A National Database Committee considers requests for access to statistical information from the database and where it is appropriate, makes this information available
ga: Déanann Coiste Bunachar Sonraí Náisiúnta breithniú ar iarratais ar rochtain ar fhaisnéis staitistiúil ón mbunachar sonraí agus sa chás gur cuí, cuireann siad an fhaisnéis seo ar fáil

source: The National Intellectual Disability Database Committee issues an Annual Report each year containing information on the current level of service provision
ga: Eisíonn Coiste Náisiúnta an Bhunachair Shonraí um Míchumas Intleachta Tuarascáil Bhliantúil gach bliain ina gcuimsítear faisnéis ar an leibhéal reatha de sholáthar seirbhíse

source: The Data Protection Act, 1988 and the Data Protection (Amendment) Act 2003 applies in the normal way to information on this database
ga: Cuirtear an tAcht um Chosaint Sonraí, 1988 agus an tAcht um Chosaint Sonraí (Leasú), 2003 i bhfeidhm ar an ngnáthbhealach i dtaobh faisnéise atá ar an mbunachar sonraí seo

source: This means, in summary, that you (or your parent or guardian if you are a child) have a right to:
ga: Ciallaíonn seo, go hachomair, go bhfuil sé de cheart agat (nó ag do thuismitheoir nó caomhnóir, más leanbh thú):

source: • Get a copy of the information held about you on the database
ga: • Cóip a fháil den fhaisnéis a choimeádtar fút ar an mbunachar sonraí

source: You can do this by contacting the Database Co-ordinator in your Local Health Office
ga: Féadfaidh tú seo a dhéanamh trí theagmháil a dhéanamh le Comhordaitheoir an Bhunachair Shonraí i d’Oifig Sláinte Áitiúil

source: • Have any inaccurate information corrected or removed
ga: • Aon fhaisnéis mhíchruinn fút a cheartú nó a bhaint

source: • Complain to the Data Protection Commissioner if your rights are not respected
ga: • Gearán a dhéanamh leis an gCoimisinéir Cosanta Sonraí mura léirítear meas ar do chearta

source: If you have any questions about the National Intellectual Disability Database contact the Disability Office in your Local Health Office
ga: Má bhraitheann tú go bhfuil faisnéis mhíchruinn á coimeád fút, ba cheart duit teagmháil a dhéanamh leis an gCoimisinéir Cosanta Sonraí
